docs/misc/todo_old.html

<div id="outline-container-org7ec720a" class="outline-2">
<h2 id="org7ec720a"><span class="section-number-2">2</span> Some Reminders</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Thu Apr 23 2020 16:40&gt;</span></span> <br />
In order to use SFINAE to interface blas/lapack method we introduced Is<sub>Symmetric</sub><sub>Matrix</sub><sub>v</sub>
</p>

<p>
Concerning predicate like Is<sub>Symmetric</sub><sub>Matrix</sub>:
</p>

<p>
We cannot use something like: (returning a bool instead of std::integral<sub>const</sub>&lt;bool,&#x2026;&gt;
</p>

<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL</span>&gt;
    <span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span>
    <span style="color: #cd9b1d;">is_symmetric_matrix_p</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Matrix_Crtp</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp;) <span style="color: #1c86ee;">noexcept</span>
    {
      <span style="color: #1c86ee;">return</span> <span style="color: #6e8b3d;">IMPL</span>::<span style="color: #6e8b3d;">matrix_special_structure_type</span>::value == <span style="color: #6e8b3d;">Matrix_Special_Structure_Enum</span>::Symmetric;
    }
</pre>
</div>

<p>
Reason:
</p>

<p>
If you want to use it in SFINAE, you cannot do 
</p>
<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">auto</span> <span style="color: #cd9b1d;">foo</span>(<span style="color: #00688b;">M</span> <span style="color: #2e8b57;">m</span>) -&gt; <span style="color: #00688b;">enable_if_t</span>&lt;is_symmetric_matrix_p(m)&gt;
</pre>
</div>

<p>
A fix is:
</p>

<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL</span>&gt;
    <span style="color: #1c86ee;">constexpr</span> <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">integral_constant</span>&lt;<span style="color: #00688b;">bool</span>, <span style="color: #6e8b3d;">IMPL</span>::<span style="color: #6e8b3d;">matrix_special_structure_type</span>::value ==
                                               <span style="color: #6e8b3d;">Matrix_Special_Structure_Enum</span>::Symmetric&gt;
    <span style="color: #cd9b1d;">is_symmetric_matrix_p</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Matrix_Crtp</span>&lt;<span style="color: #00688b;">IMPL</span>&gt;&amp;) <span style="color: #1c86ee;">noexcept</span>
    {
      <span style="color: #1c86ee;">return</span> {};
    }
</pre>
</div>

<p>
then
</p>

<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">auto</span> <span style="color: #cd9b1d;">foo</span>(<span style="color: #00688b;">M</span> <span style="color: #2e8b57;">m</span>) -&gt; <span style="color: #00688b;">enable_if_t</span>&lt;<span style="color: #1c86ee;">decltype</span>(is_symmetric_matrix_p(m))::<span style="color: #2e8b57;">value</span>&gt;
</pre>
</div>

<p>
That works, but that's not a nice syntax
</p>

<p>
One can define 
</p>
<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
    <span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Is_Symmetric_Matrix</span> : <span style="color: #1c86ee;">decltype</span>(is_symmetric_matrix_p(<span style="color: #6e8b3d;">std</span>::declval&lt;<span style="color: #00688b;">T</span>&gt;()))
    {
    };
    
    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
    <span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Symmetric_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Symmetric_Matrix</span>&lt;<span style="color: #00688b;">T</span>&gt;::value;
</pre>
</div>

<p>
then
</p>

<div class="org-src-container">
<pre class="src src-cpp">    <span style="color: #1c86ee;">auto</span> <span style="color: #cd9b1d;">foo</span>(<span style="color: #00688b;">M</span> <span style="color: #2e8b57;">m</span>) -&gt; <span style="color: #00688b;">enable_if_t</span>&lt;<span style="color: #00688b;">Is_Symmetric_Matrix_v</span>&lt;<span style="color: #00688b;">M</span>&gt;&gt;
</pre>
</div>

<p>
However as we finally end up with a struct "Is<sub>Symmetric</sub><sub>Matrix</sub>"
it it SHORTED to directly define it:
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">ENABLE</span> = <span style="color: #00688b;">void</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Is_Symmetric_Matrix</span> : <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">false_type</span>
{
};

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Is_Symmetric_Matrix</span>&lt;<span style="color: #00688b;">T</span>, <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">enable_if_t</span>&lt;<span style="color: #00688b;">Is_Crtp_Interface_Of_v</span>&lt;Dense_Matrix_Crtp, <span style="color: #00688b;">T</span>&gt; <span style="color: #1c86ee;">and</span>
                                               (<span style="color: #6e8b3d;">T</span>::<span style="color: #6e8b3d;">matrix_special_structure_type</span>::value ==
                                                <span style="color: #6e8b3d;">Matrix_Special_Structure_Enum</span>::Symmetric)&gt;&gt;
    : <span style="color: #6e8b3d;">std</span>::true_type
{
};

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Is_Symmetric_Matrix_v</span> = <span style="color: #6e8b3d;">Is_Symmetric_Matrix</span>&lt;<span style="color: #00688b;">T</span>&gt;::value;
</pre>
</div>


<ul class="org-ul">
<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Thu Apr 23 2020 15:17&gt;</span></span> <br />
<b>IMPORTANT</b>
A SFINAE example that may be useful when wrapping blas&#x2026;
as it avoid usage of Is<sub>Supported</sub><sub>Scalar</sub> etc&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">&lt;iostream&gt;</span>
<span style="color: #cdad00;">#include</span> <span style="color: #8b7355;">&lt;type_traits&gt;</span>

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span>... <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Always_True</span> : <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">true_type</span>
{
};

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span>... <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">inline</span> <span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Always_True_v</span> = <span style="color: #6e8b3d;">Always_True</span>&lt;<span style="color: #00688b;">T</span>...&gt;::value;

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span>... <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Always_False</span> : <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">false_type</span>
{
};

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span>... <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">inline</span> <span style="color: #1c86ee;">constexpr</span> <span style="color: #00688b;">bool</span> <span style="color: #2e8b57;">Always_False_v</span> = <span style="color: #6e8b3d;">Always_False</span>&lt;<span style="color: #00688b;">T</span>...&gt;::value;

<span style="color: #00688b;">void</span>
<span style="color: #cd9b1d;">foo</span>(<span style="color: #00688b;">double</span> <span style="color: #2e8b57;">x</span>)
{
}
<span style="color: #00688b;">void</span>
<span style="color: #cd9b1d;">foo</span>(<span style="color: #00688b;">float</span> <span style="color: #2e8b57;">x</span>)
{
}

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">A</span>
{
  <span style="color: #00688b;">T</span> <span style="color: #2e8b57;">x</span>;
};

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">B</span> : <span style="color: #00688b;">A</span>&lt;<span style="color: #00688b;">T</span>&gt;
{
};

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Works, however we cannot add extra constraints</span>
<span style="color: #7f7f7f;">//</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">template &lt;typename T&gt;</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">auto</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">test(const B&lt;T&gt;&amp; b) -&gt; decltype(foo(b.x))</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">{</span>
<span style="color: #7f7f7f;">//   </span><span style="color: #7f7f7f;">std::cout &lt;&lt; __PRETTY_FUNCTION__ &lt;&lt; std::endl;</span>
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">}</span>

<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Alternative</span>
<span style="color: #7f7f7f;">//</span>
<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #1c86ee;">auto</span>
<span style="color: #cd9b1d;">test</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">B</span>&lt;<span style="color: #00688b;">T</span>&gt;&amp; <span style="color: #2e8b57;">b</span>)
  -&gt; <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">enable_if_t</span>&lt;<span style="color: #00688b;">Always_True_v</span>&lt;<span style="color: #1c86ee;">decltype</span>(foo(b.x))&gt; &amp;&amp; <span style="color: #6e8b3d;">true</span> <span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">&lt;- extra constraints */</span>&gt;
{
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; __PRETTY_FUNCTION__ &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">T</span>&gt;
<span style="color: #00688b;">void</span>
<span style="color: #cd9b1d;">test</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">A</span>&lt;<span style="color: #00688b;">T</span>&gt;&amp; <span style="color: #2e8b57;">a</span>)
{
  <span style="color: #6e8b3d;">std</span>::cout &lt;&lt; __PRETTY_FUNCTION__ &lt;&lt; <span style="color: #6e8b3d;">std</span>::endl;
}

<span style="color: #00688b;">int</span>
<span style="color: #cd9b1d;">main</span>()
{
  {
    <span style="color: #00688b;">B</span>&lt;<span style="color: #00688b;">double</span>&gt; <span style="color: #2e8b57;">b</span>;
    test(b);
  }
  {
    <span style="color: #00688b;">B</span>&lt;<span style="color: #00688b;">float</span>&gt; <span style="color: #2e8b57;">b</span>;
    test(b);
  }

  {
    <span style="color: #00688b;">B</span>&lt;<span style="color: #00688b;">int</span>&gt; <span style="color: #2e8b57;">b</span>;
    test(b);
  }
  {
    <span style="color: #00688b;">B</span>&lt;<span style="color: #00688b;">A</span>&lt;<span style="color: #00688b;">int</span>&gt;&gt; <span style="color: #2e8b57;">b</span>;
    test(b);
  }
}
</pre>
</div></li>

<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Tue Apr 21 2020 12:25&gt;</span></span> <br />
meson + valgrind:
</p>

<div class="org-src-container">
<pre class="src src-sh">meson test --wrap=<span style="color: #8b7355;">'valgrind --leak-check=full --error-exitcode=1'</span> 
</pre>
</div>

<p>
Also see:
<a href="https://mesonbuild.com/Unit-tests.html#other-test-options">https://mesonbuild.com/Unit-tests.html#other-test-options</a>
</p></li>
<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Apr 15 2020 22:04&gt;</span></span> <br />
I just fixed a <b>bug</b> by replacing:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">Common_Element_Type_t</span>&lt;V0_IMPL, V1_IMPL&gt; <span style="color: #2e8b57;">sum</span>{};  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">&lt;--</span>
    
<span style="color: #1c86ee;">if</span> <span style="color: #1c86ee;">constexpr</span> (<span style="color: #00688b;">Is_Complex_v</span>&lt;<span style="color: #00688b;">Element_Type_t</span>&lt;V0_IMPL&gt;&gt;)
{
  scan([&amp;<span style="color: #2e8b57;">sum</span>](<span style="color: #1c86ee;">const</span> <span style="color: #1c86ee;">auto</span>&amp; <span style="color: #2e8b57;">v0_component</span>,
              <span style="color: #1c86ee;">const</span> <span style="color: #1c86ee;">auto</span>&amp; <span style="color: #2e8b57;">v1_component</span>) { sum += conjugate(v0_component) * v1_component; },
       V0, V1);
    }
</pre>
</div>

<p>
by
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00688b;">Common_Element_Type_t</span>&lt;V0_IMPL, V1_IMPL&gt; <span style="color: #2e8b57;">sum</span>;  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">&lt;--</span>
sum = 0;                                      <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">&lt;--</span>
    
<span style="color: #1c86ee;">if</span> <span style="color: #1c86ee;">constexpr</span> (<span style="color: #00688b;">Is_Complex_v</span>&lt;<span style="color: #00688b;">Element_Type_t</span>&lt;V0_IMPL&gt;&gt;)
{
  scan([&amp;<span style="color: #2e8b57;">sum</span>](<span style="color: #1c86ee;">const</span> <span style="color: #1c86ee;">auto</span>&amp; <span style="color: #2e8b57;">v0_component</span>,
              <span style="color: #1c86ee;">const</span> <span style="color: #1c86ee;">auto</span>&amp; <span style="color: #2e8b57;">v1_component</span>) { sum += conjugate(v0_component) * v1_component; },
       V0, V1);
    }
</pre>
</div>

<p>
<b>This is the right way to do.</b>
</p>

<p>
Explanation
</p>

<p>
When the type is <code>double</code>, <code>int</code>, <code>sum{}</code> is okay. However when the <code>sum</code> type
is <code>AD&lt;T&gt;</code> (autodiff) or another vector/matrix the one must proceed in
two step: <code>sum;</code> which is the default constructor that does a minimal
work, <b>then</b> fill it with zero by <code>sum=0</code>.
</p></li>

<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Apr 15 2020 16:33&gt;</span></span> <br />
Begin,End versus Begin,Size convention:
</p>

<pre class="example">
         CAVEAT: for views our convention is *always* to use [begin,end[ and NOT (begin,size)
                 by example view(2,4) mean {v_2,v_3}, begin=2, end=4 (and NOT {v_2,v_3,v_4,v_5}, begin=2, size=4)) 
</pre></li>

<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Apr 15 2020 16:31&gt;</span></span> <br />
Comparison operators, one bug to clarify:
</p>

<pre class="example">
    
    CAVEAT: DO NOT DEFINE &gt;= AS !&lt; (FOR ARRAY).                               
                                                                         
    Reason: if you do so you will have:                                          
       (1)  (1,1) &lt;  (1,1)  FALSE                                             
            but, if &gt;= is !&lt;                                                  
       (2)  (1,0) &gt;= (1,1) TRUE &lt;- which is NOT what we expect                
                                                                              
       (1)  (a0 &lt; b0) and (a1 &lt; b1)                                           
    but !(1) is                                                               
       (2)  (a0 &gt;= b0) or (a1 &gt;= b1) (but we want (a0 &gt;= b0) _AND_ (a1 &gt;= b1))
                                                                              
</pre></li>

<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Apr 15 2020 16:29&gt;</span></span> <br />
ADL example
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">LinearAlgebra</span>
{
  <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">Detail</span>
  {
    <span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Detail_ADL</span>
    {
    };
    
    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_0</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_1</span>&gt;
    <span style="color: #00688b;">bool</span>
    <span style="color: #cd9b1d;">impl_comparison</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Detail_ADL</span> <span style="color: #2e8b57;">detail_ADL</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_0</span>&gt;&amp; <span style="color: #2e8b57;">vector_0</span>,
                    <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_1</span>&gt;&amp; <span style="color: #2e8b57;">vector_1</span>)
    {
      <span style="color: #1c86ee;">return</span> impl_comparison(detail_ADL, vector_0.impl(), vector_1.impl());
    }
  }
    
  <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_0</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_1</span>&gt;
  <span style="color: #00688b;">bool</span>
  <span style="color: #1c86ee;">operator</span><span style="color: #cd9b1d;">==</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_0</span>&gt;&amp; <span style="color: #2e8b57;">vector_0</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_1</span>&gt;&amp; <span style="color: #2e8b57;">vector_1</span>)
  {
    <span style="color: #1c86ee;">return</span> impl_comparison(<span style="color: #6e8b3d;">Detail</span>::Detail_ADL(), vector_0, vector_1);
  }
    
  <span style="color: #1c86ee;">namespace</span> <span style="color: #6e8b3d;">Detail</span>
  {
    <span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_0</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL_1</span>&gt;
    <span style="color: #00688b;">bool</span>
    <span style="color: #cd9b1d;">impl_comparison</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Detail_ADL</span> <span style="color: #2e8b57;">detail_ADL</span>, <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_0</span>&gt;&amp; <span style="color: #2e8b57;">vector_0</span>,
                    <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&lt;<span style="color: #00688b;">IMPL_1</span>&gt;&amp; <span style="color: #2e8b57;">vector_1</span>)
    {
      <span style="color: #1c86ee;">return</span> <span style="color: #6e8b3d;">true</span>;
    }
  }
}
</pre>
</div>

<p>
Archived, for the moment we do not systematically use this kind of stuff
</p></li>

<li><p>
Note taken on <span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Apr 15 2020 16:29&gt;</span></span> <br />
To prevent object slicing it is important to define this kind of stuff
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">IMPL</span>&gt;
<span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>
{
<span style="color: #1c86ee;">protected</span>: <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">&lt;- </span><span style="color: #ff0000;">CAVEAT</span>
  <span style="color: #cd9b1d;">Dense_Vector_Crtp</span>()                         = <span style="color: #1c86ee;">default</span>;
  <span style="color: #cd9b1d;">Dense_Vector_Crtp</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&amp;) = <span style="color: #1c86ee;">default</span>;
  <span style="color: #cd9b1d;">Dense_Vector_Crtp</span>(<span style="color: #00688b;">Dense_Vector_Crtp</span>&amp;) = <span style="color: #1c86ee;">default</span>;
  <span style="color: #00688b;">Dense_Vector_Crtp</span>&amp; <span style="color: #1c86ee;">operator</span><span style="color: #cd9b1d;">=</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Dense_Vector_Crtp</span>&amp;) = <span style="color: #1c86ee;">default</span>;
  <span style="color: #00688b;">Dense_Vector_Crtp</span>&amp; <span style="color: #1c86ee;">operator</span><span style="color: #cd9b1d;">=</span>(<span style="color: #00688b;">Dense_Vector_Crtp</span>&amp;) = <span style="color: #1c86ee;">default</span>;
};
</pre>
</div></li>
</ul>
</div>
</div>
