docs/misc/todo_old.html

<div id="outline-container-orgd311af4" class="outline-2">
<h2 id="orgd311af4"><span class="section-number-2">3</span> Meson &amp; external dependency (here slate/blaspp)</h2>
<div class="outline-text-2" id="text-3">
<p>
Two solutions:
</p>
<ul class="org-ul">
<li>suproject</li>
<li>external dependency</li>
</ul>
</div>

<div id="outline-container-org82337ea" class="outline-3">
<h3 id="org82337ea"><span class="section-number-3">3.1</span> subproject</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This worked, but certainly need some cleaning
</p>
</div>

<div id="outline-container-org85a1c3a" class="outline-4">
<h4 id="org85a1c3a"><span class="section-number-4">3.1.1</span> <code>/meson.build</code></h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
project('LinearAlgebra', 'cpp',
	version : '0.0.1',
	default_options : ['cpp_std=c++17'])

gtest_proj = subproject('gtest')
gtest_dep = gtest_proj.get_variable('gtest_main_dep')

################
# Slate Blaspp #
################
#
cmake = import('cmake')

# note: you can add cmake options here:
#       cmake.subproject('blaspp', cmake_options: '-DSOME_CMAKE_VAR=something')
# todo: add NDEBUG etc for release 
blaspp_proj = cmake.subproject('blaspp')
# Note: you have to search CMakeList.txt add_library(...)
#       to find the right library name 'blaspp' in .dependency('blaspp')
#
# Meson doc:
# https://github.com/mesonbuild/meson/tree/36749a1625534386c1adefcd8ced5b45144501d1/test%20cases/cmake
blaspp_dep = blaspp_proj.dependency('blaspp')
install_headers(blaspp_proj.include_directories('blaspp')) # 'subprojects/blaspp/include')

subdir('src')
subdir('test')
subdir('bin')
subdir('sandbox')
subdir('examples')
</pre>
</div>
</div>

<div id="outline-container-org609c880" class="outline-4">
<h4 id="org609c880"><span class="section-number-4">3.1.2</span> <code>/src/LinerarAlgebra/meson.build</code></h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
LinearAlgebra_headers = [ ... ]
LinearAlgebra_sources = [ ... ]

subdir('...')

LinearAlgebra_lib = library('LinearAlgebra',
			    include_directories : inc,
			    install : true,
			    sources: [LinearAlgebra_headers,LinearAlgebra_sources])

LinearAlgebra_dep = declare_dependency(include_directories : inc,
				       link_with : [LinearAlgebra_lib,],
				       dependencies : [blas_lib,])         # &lt;-- HERE

install_headers(LinearAlgebra_headers, subdir : 'LinearAlgebra')
</pre>
</div>
</div>

<div id="outline-container-org6461690" class="outline-4">
<h4 id="org6461690"><span class="section-number-4">3.1.3</span> <code>/subproject/blaspp.wrap</code></h4>
<div class="outline-text-4" id="text-3-1-3">
<pre class="example">
# See: https://github.com/mesonbuild/meson/tree/master/manual%20tests/6%20hg%20wrap

[wrap-hg]
directory=blaspp
url=https://bitbucket.org/icl/blaspp
revision=tip
</pre>
</div>
</div>

<div id="outline-container-orga098965" class="outline-4">
<h4 id="orga098965"><span class="section-number-4">3.1.4</span> <code>/examples/meson.build</code></h4>
<div class="outline-text-4" id="text-3-1-4">
<pre class="example">
#include "blas.hh"

#include &lt;iostream&gt;

// The 3x2 matrix, column major
// { 1, 2 }
// { 3, 4 }
// { 5, 6 }
double M_32[6] = {1, 3, 5, 2, 4, 6};

int main()
{
  std::cout &lt;&lt; "\n\n norm " &lt;&lt; blas::nrm2(6,M_32,1);
}
</pre>

<pre class="example">
executable('blaspp_example',
	   'blaspp_example.cpp',
	   dependencies : [LinearAlgebra_dep, blaspp_dep])
</pre>
</div>
</div>
</div>

<div id="outline-container-org09f3552" class="outline-3">
<h3 id="org09f3552"><span class="section-number-3">3.2</span> External dependency</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This worked, but certainly need some cleaning.
</p>

<p>
This library depends on 
</p>
<ul class="org-ul">
<li><a href="https://bitbucket.org/icl/blaspp/src/default/">slate/blaspp</a></li>
<li><a href="https://bitbucket.org/icl/lapackpp/src/default/">slate/lapackpp</a></li>
</ul>

<p>
To install <code>lapackpp</code> (without the tests)
</p>
<div class="org-src-container">
<pre class="src src-sh">hg clone https://bitbucket.org/icl/lapackpp
mkdir build
<span style="color: #cd6600;">cd</span> build/
cmake -DBUILD_LAPACKPP_TESTS=false ..
make
make install 
</pre>
</div>

<p>
TODO: how to install optimized version. To check: one has to define:
</p>
<ul class="org-ul">
<li>for <code>blaspp</code> <code>-DBLAS_ERROR_NDEBUG</code> (used in <code>blas_util.hh</code>)</li>
<li>for <code>lapackpp</code> <code>-DLAPACK_ERROR_NDEBUG</code> (used in <code>lapack_util.hh</code>)</li>
</ul>

<p>
The default install directory of <code>blaspp</code> and <code>lapackpp</code> is
<code>/opt/slate/</code>. This is the directory used by the meson script.  You can
always modify these paths in the root meson.build file (in
<code>LinearAlgebra/meson.build</code>). By example:
</p>
<div class="org-src-container">
<pre class="src src-meson"><span style="color: #7f7f7f;">#</span>
<span style="color: #7f7f7f;"># blaspp</span>
<span style="color: #7f7f7f;">#</span>
<span style="color: #2e8b57;">blaspp_lib</span> = <span style="color: #8b7355;">'blaspp'</span>
<span style="color: #2e8b57;">blaspp_lib_dir</span> = <span style="color: #8b7355;">'/opt/slate/lib'</span>         <span style="color: #7f7f7f;"># &lt;- modify me</span>
<span style="color: #2e8b57;">blaspp_header_dir</span> = <span style="color: #8b7355;">'/opt/slate/include'</span>  <span style="color: #7f7f7f;"># &lt;- modify me</span>
</pre>
</div>
</div>


<div id="outline-container-org1c44e59" class="outline-4">
<h4 id="org1c44e59"><span class="section-number-4">3.2.1</span> <code>/meson.build/</code></h4>
<div class="outline-text-4" id="text-3-2-1">
<pre class="example">
project('LinearAlgebra', 'cpp',
	version : '0.0.1',
	default_options : ['cpp_std=c++17'])

gtest_proj = subproject('gtest')
gtest_dep = gtest_proj.get_variable('gtest_main_dep')

#
# blaspp
#
blaspp_lib = 'blaspp'
blaspp_lib_dir = '/opt/slate/lib'
blaspp_header_dir = '/opt/slate/include'

blaspp_dep = declare_dependency(link_args : ['-L' + blaspp_lib_dir, '-l' + blaspp_lib],
 				include_directories : include_directories(blaspp_header_dir))

subdir('src')
subdir('test')
subdir('bin')
subdir('sandbox')
subdir('examples')
</pre>
</div>
</div>

<div id="outline-container-orgbcdaf6f" class="outline-4">
<h4 id="orgbcdaf6f"><span class="section-number-4">3.2.2</span> <code>/src/LinearAlgebra/meson.build</code></h4>
<div class="outline-text-4" id="text-3-2-2">
<pre class="example">
LinearAlgebra_headers = [...]
LinearAlgebra_sources = [...]

subdir(...)

LinearAlgebra_lib = library('LinearAlgebra',
			    include_directories : inc,
			    install : true,
			    sources: [LinearAlgebra_headers,LinearAlgebra_sources])

LinearAlgebra_dep = declare_dependency(include_directories : inc,
				       link_with : [LinearAlgebra_lib,],
				       dependencies : [blas_lib,blaspp_dep])  # &lt;--- HERE

install_headers(LinearAlgebra_headers, subdir : 'LinearAlgebra')
</pre>
</div>
</div>

<div id="outline-container-orgf160b1a" class="outline-4">
<h4 id="orgf160b1a"><span class="section-number-4">3.2.3</span> <code>/example/meson.build</code></h4>
<div class="outline-text-4" id="text-3-2-3">
<pre class="example">
executable('test_blaspp',
	   'test_blaspp.cpp',
	   build_rpath : '/opt/slate/lib',         # &lt;-- CAVEAT
	   install_rpath : '/opt/slate/lib',       # &lt;-- CAVEAT
	   dependencies : [LinearAlgebra_dep, blaspp_dep])
</pre>
</div>
</div>

<div id="outline-container-org5b29052" class="outline-4">
<h4 id="org5b29052"><span class="section-number-4">3.2.4</span> <code>/subproject/</code></h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
There is nothing related to blas (appart gtest)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b960bc" class="outline-2">
<h2 id="org5b960bc"><span class="section-number-2">4</span> Backlinks</h2>
</div>


<div id="outline-container-org632b065" class="outline-2">
<h2 id="org632b065"><span class="section-number-2">5</span> 1 Backlinks</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgfe24aac" class="outline-3">
<h3 id="orgfe24aac"><span class="section-number-3">5.1</span> <a href="../index.html">My Sitemap</a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="misc/todo_old.html">Reminder &amp; TODO list</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: picaud</p>
<p class="date">Created: 2020-07-09 Thu 20:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
